### pandas for data analysis and visulization
### pandas data structure and analyze giles

In [1]:
import pandas as pd

In [4]:
new_s = pd.Series([100,200,300,400])

In [5]:
new_s

0    100
1    200
2    300
3    400
dtype: int64

In [6]:
new_s[0]

100

In [7]:
next_index = pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

In [8]:
next_index

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [37]:
# dataframe has two dimension rows and columns 
colors = ["red","green","blue","black"]
degree = [50,60,70,80]
place = ["ktm","bkt","ltp","brt"]

newDf= pd.DataFrame({"colors":colors,"degree":degree,"place":place},
                   columns = ["colors","degree","place"],
                   index=range(1,5))

In [38]:
newDf

  colors  degree place
1    red      50   ktm
2  green      60   bkt
3   blue      70   ltp
4  black      80   brt

In [21]:
#to read csv file
file_csv = pd.read_csv("addresses.csv",low_memory=False)

In [22]:
file_csv

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [23]:
file_csv.head(3)

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234

In [24]:
# read content inside the html file
url1="https://en.wikipedia.org/wiki/Academy_Awards"

In [25]:
new_html = pd.read_html(url1, header = 0,index_col=0)[3]

In [26]:
new_html.head(5)

,Unnamed: 1,Unnamed: 2
Award,Best Actor,Best Actress
Winner,Anthony Hopkins(The Father),Frances McDormand(Nomadland)
NaN,NaN,NaN
Award,Best Supporting Actor,Best Supporting Actress
Winner,Daniel Kaluuya(Judas and the Black Messiah),Youn Yuh-jung(Minari)

In [29]:
newDf.shape

(4, 3)

In [30]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   colors   4 non-null      object
 1   degrees  4 non-null      int64
 2   places   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [31]:
file_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   John               4 non-null      object
 1   Doe                5 non-null      object
 2   120 jefferson st.  4 non-null      object
 3   Riverside          5 non-null      object
 4    NJ                5 non-null      object
 5    08075             5 non-null      int64
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

In [32]:
file_csv.describe()

              08075
count      5.000000
mean   21769.800000
std    39059.209909
min      123.000000
25%      298.000000
50%     8075.000000
75%     9119.000000
max    91234.000000

In [44]:
newDf.loc[newDf["degree"].argmax()][["degree"]]

degree    70
Name: 3, dtype: object

In [46]:
#read the excel file

In [57]:
new_excel = pd.read_excel("Financial Sample.xlsx" , sheet_name = 0)

In [58]:
print(new_excel.head(6))

      Segment  Country    Product Discount Band  Units Sold  \
0  Government   Canada  Carretera          None      1618.5
1  Government  Germany  Carretera          None      1321.0
2   Midmarket   France  Carretera          None      2178.0
3   Midmarket  Germany  Carretera          None       888.0
4   Midmarket   Mexico  Carretera          None      2470.0
5  Government  Germany  Carretera          None      1513.0

   Manufacturing Price  Sale Price  Gross Sales  Discounts     Sales  \
0                    3          20      32370.0        0.0   32370.0
1                    3          20      26420.0        0.0   26420.0
2                    3          15      32670.0        0.0   32670.0
3                    3          15      13320.0        0.0   13320.0
4                    3          15      37050.0        0.0   37050.0
5                    3         350     529550.0        0.0  529550.0

       COGS    Profit       Date  Month Number Month Name  Year
0   16185.0   16185.0 2014-01-01             1    January  2014
1   13210.0   13210.0 2014-01-01             1    January  2014
2   21780.0   10890.0 2014-06-01             6       June  2014
3    8880.0    4440.0 2014-06-01             6       June  2014
4   24700.0   12350.0 2014-06-01             6       June  2014
5  393380.0  136170.0 2014-12-01            12   December  2014

In [ ]:
## to read json file read_json()